Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_384-Glorious_King_of_Tantras_That_Resolves_All_Secrets-v1.tmx
Source language: bo
Languages: en

source: དཔལ་རྡོ་རྗེ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to Glorious Vajrasattva!

source: །འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་སྙིང་པོ་ལ་སོགས་པའི་འཁོར་རྣམས་ཀྱིས་གཡོན་གྱི་ཕྱོགས་ནས་སྐོར་བ་ལན་གསུམ་བྱས་ནས་
en: Then, the entourage, including bodhisattva Vajragarbha and others performed three circumambulations counterclockwise,

source: ཕྱི་ནང་གསང་བའི་མཆོད་པས་མཆོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: made outer, inner, and secret offerings, and asked the following:

source: །ཀྱེ་ཧོ་བཅོམ་ལྡན་རྡོ་རྗེ་འཛིན།
en: O Blessed Vajra Holder!

source: །གསང་བ་ཞེས་པ་ཇི་ལྟར་ལགས།
en: What is “secret”?

source: །དེ་ཡི་གཅོད་པ་ཇི་ལྟར་ལགས།
en: How is it resolved?

source: །རྒྱུད་ཀྱི་དོན་ནི་ཇི་ལྟར་ལགས།
en: What is the meaning of tantra?

source: །དེ་ཡི་རྒྱལ་པོའང་ཇི་ལྟར་ལགས།
en: And what is its king?

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One said:

source: །གསང་བ་ཞེས་པ་རྣམ་པ་བཞི།
en: “Secret” is four-fold.

source: །དེ་ཡི་ཁྱད་པར་དགོངས་པའི་དོན།
en: Its individual features all have an intended meaning.

source: །དང་པོ་སྟོང་ཉིད་ལ་སོགས་པ། །རྒྱུད་གཞན་དུ་ནི་ང་ཡིས་གསུངས།
en: Firstly, in other tantras, I taught about emptiness and so forth.

source: །རྟེན་དང་བརྟེན་པའི་བྱེ་བྲག་ལ།
en: Among the particulars of the support and supported,

source: །དང་པོ་རྟེན་གྱི་དགོངས་པ་ཡང་།
en: The first concerns the intention behind the support.

source: །ཐུགས་ཀའི་ཡི་གེ་ཧཱུྃ་ལས་ནི།
en: The syllable hūṁ at the heart

source: །མར་མེ་གཅིག་ལས་གཉིས་ཀྱི་ཚུལ།
en: Imagine that, like one candle lighting another,

source: །ཁ་དོག་ནག་པོའི་ཨེ་འཕྲོས་པས།
en: Projects a black-hued e,

source: །གྲུ་གསུམ་རྒྱ་ཆེ་གཏིང་རིང་བསམ།
en: Which forms a vast, deep triangle.

source: །གྲུ་གསུམ་སྐུ་གསུང་ཐུགས་ཡིན་ཏེ།
en: The three corners are enlightened body, speech, and mind.

source: །དུག་གསུམ་འཇོམས་པ་དགོངས་པའི་དོན།
en: This signifies the destruction of the three poisons.

source: །ལོགས་ནི་རྣམ་ཐར་གསུམ་ཡིན་ཏེ།
en: The sides are the three liberations.

source: །ལུས་ངག་ཡིད་གསུམ་ལས་བྱུང་བའི། །མི་དགེ་བཅུ་འཇོམས་དགོངས་པའི་དོན།
en: This signifies the destruction of the ten non-virtues That emerge from ordinary body, speech, and mind.

source: །ཆོས་ཀྱི་སྐུ་ནི་དྲི་མེད་ཀྱིས། །རང་བཞིན་གྱིས་ནི་ཀུན་ལ་ཁྱབ།
en: The dharma body is immaculate, And therefore naturally all-pervading.

source: །དེ་ཕྱིར་རྒྱ་ཆེན་དགོངས་པའི་དོན།
en: This is the significance of vast.

source: །འཕགས་པ་ཉན་ཐོས་རང་རྒྱལ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་།
en: Since even the noble listeners, solitary realizers, And bodhisattvas as well,

source: །ཆོས་སྐུ་རྟོགས་པ་མ་ཡིན་པས།
en: Do not realize the dharma body,

source: །རང་བཞིན་གྱིས་ནི་ཀུན་ལ་ཁྱབ།
en: naturally all-pervading

source: །གཏིང་རིང་བ་རུ་དགོངས་པས་བཤད།
en: It is explained with intention as deep.

source: །དེ་ནས་ཐུགས་ཀའི་ཧཱུྃ་ལས་ཡང་། ། ཧཱུྃ་འཕྲོས་པ་ལས་རྡོ་རྗེར་གྱུར། །རྡོ་རྗེ་གུར་དུ་གྱུར་པ་ཡང་།
en: Then, again the hūṁ at the heart Projects a hūṁ syllable that forms into a vajra, Which forms into a vajra tent.

source: །ཕྱི་ཡིས་ཚེ་ཡི་བར་ཆད་བྱེད།
en: The outer creates obstacles to life.

source: །ནང་གིས་ཐར་པའི་བར་ཆད་བྱེད།
en: The inner creates obstacles to liberation.

source: །བར་ཆད་རྣམ་པ་གཉིས་བསྲུང་བ། །རྡོ་རྗེ་གུར་གྱི་དགོངས་པའི་དོན།
en: The significance of the vajra tent Is that it protects from the two-fold obstructions.

source: །ཡྃ་ལས་བྱུང་བའི་གོང་དང་འདྲ། །དབྱིབས་ནི་ཟླ་གམ་ལྟ་བུ་སྟེ།
en: Then yaṁ, just as before, Projects a shape, like a half-moon.

source: །རྣམ་པར་རྟོག་པ་སྤོང་བ་དང་། །མི་རྟོག་པ་ནི་སྐྱེ་བ་ལ།
en: It provides control over the abandonment of conceptuality And the dawn of non-conceptuality.

source: །དབང་དུ་བྱེད་པས་དབང་གི་དོན།
en: This is the meaning of domination.

source: །བ་དན་བཞི་ཡི་དགོངས་པ་ཡང་། །ཆོས་རྣམས་དུས་གསུམ་གནས་པ་ཡི། །དགོངས་པ་ཡིན་པར་ང་ཡིས་གསུངས།
en: Concerning the significance of the four flags, I have taught that it signifies all things Present throughout the three times.

source: །རྃ་ལས་མེ་ཡི་དཀྱིལ་འཁོར་ནི། །ཟུར་གསུམ་དྲག་པོའི་དགོངས་པ་ཡིན།
en: The triangular fire maṇḍala from raṁ Signifies wrathful ritual.

source: །རྡོ་རྗེ་རྩེ་གསུམ་སྐུ་གསུམ་དོན།
en: The three-pronged vajra signifies the three buddha bodies.

source: །བྃ་ལས་ཆུ་ཡི་དཀྱིལ་འཁོར་ཏེ། ། ཟླུམ་པོ་སྤྲོས་པ་ཞི་བར་གསུངས།
en: The round water disk from baṁ Is said to be the cessation of mental activity.

source: །བུམ་པ་ཆོས་སྐུའི་ཡན་ལག་བཞི།
en: The vase is the four aspects of the dharma body.

source: །ལྃ་ལས་གསེར་གྱི་ས་གཞི་སྟེ། །གྲུ་བཞི་རྒྱས་པའི་རང་བཞིན་ཏེ།
en: The square golden earth from laṁ Has the nature of prosperity.

source: །རྡོ་རྗེ་རྩེ་ལྔ་ཡེ་ཤེས་ལྔ།
en: The five-pronged vajra is the five gnoses.

source: །དེ་སྟེང་རི་རབ་རྩེ་མོ་བརྒྱད། །རྣམ་ཐར་བརྒྱད་ཀྱི་དགོངས་པ་ཡིན
en: The eight peaks of Mount Meru above that Signify the eight liberations.

source: །སྣོད་བཅུད་རྣམ་རྟོག་མི་མངའི་རྟགས། །དུར་ཁྲོད་བརྒྱད་ནི་གཡས་དང་གཡོན། །གོ་རིམས་བཞིན་དུ་དགོད་པར་བྱ།
en: Symbolizing the absence of conceptuality about an ordinary universe and inhabitants, The eight charnel grounds Should be arranged to left and right in order.

source: །རེ་རེའི་བྱེ་བྲག་རྣམ་རྟོག་ཡང་། །བླ་མའི་ཞལ་ལས་ཤེས་པར་བྱ།
en: The concepts related to each feature, moreover, Should be learned from a master’s oral instructions.

source: །གཉེན་པོའི་སྟོབས་ནི་ཡོངས་སུ་རྒྱས། །ཤིང་རྣམས་རིམ་བཞིན་རྟག་ཏུ་དགོད།
en: Symbolizing the power of the antidote fully developed, Trees are continuously arranged in sequence.

source: །རྣམ་རྟོག་མི་དགེ་བཅུ་ཡི་དོན། །འཇོམས་པའི་རྟགས་སུ་ཕྱོགས་སྐྱོང་དགོད།
en: The directional protectors are arranged as symbols For the overcoming of concepts oriented toward the ten non-virtues.

source: །འདོད་ཆགས་ཞེ་སྡང་མ་རིག་པ། །གདུག་པ་འཇོམས་ཕྱིར་ཀླུ་བརྒྱད་དགོད།
en: The eight nāgas are stationed To destroy the wicked ones Of attachment, hatred and ignorance.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་དང་། གསུང་དང་། ཐུགས་རྡོ་རྗེ་བཙུན་མོའི་བྷ་ག་ལ་སྙོམས་པར་བཞུགས་སོ།
en: The Blessed One dwelt in equanimity in the womb of the Vajra Lady, which is the enlightened body, speech, and mind of all tathāgatas.

source: །རྟེན་དང་བརྟེན་པར་བསྒོམ་པ་ནི། །སྣོད་བཅུད་གཟུང་འཛིན་རྣམ་རྟོག་རྣམས། །སྤང་ཕྱིར་ང་ཡིས་གསུངས་པ་ཡིན།
en: I taught meditation on the support and the supported So that practitioners might relinquish Dualistic concepts of a universe and its inhabitants.

source: །དང་པོ་བུམ་དབང་དང་འབྲེལ་བའི། །བསྐྱེད་པའི་རིམ་པའི་རྣལ་འབྱོར་ཏེ།
en: First is the practice of the development stage Related to the vase initiation.

source: །དང་པོ་ཚེ་ཡི་བར་ཆད་དང་། །གཉིས་པ་ཐར་པའི་བར་ཆད་དེ།
en: There are two obstacles: first, to life, And second, to liberation.

source: །བགེགས་ནི་རྣམ་པ་གཉིས་ཡིན་ཏེ། །ཕྱི་ཡི་བགེགས་དང་ནང་གི་བགེགས།
en: These are the two obstructing forces, The outer and the inner.

source: །ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ། །གཟུགས་སྐུ་གཉིས་ཀྱི་ང་རྒྱལ་གྱིས། །ལུས་དང་ངག་གི་སེམས་ཅན་གྱིས། ། དོན་མཛད་ཕྱིར་ནི་ཆར་སྤྲིན་དགོད།
en: Rain clouds are arrayed So that body and speech may act for the welfare of beings, With divine pride in the two form buddha bodies Endowed with great compassion.

source: །ནང་དང་གསང་བ་དེ་བཞིན་ནོ།
en: Inner and secret are the same.

source: །དེ་བཞིན་མཐར་ཐུག་བཞི་པ་ཡང་།
en: Likewise, as for the ultimate, the fourth,

source: །སྙན་ནས་བརྒྱུད་པ་ཤེས་པར་བྱ།
en: One should learn the oral tradition.

source: །བྷྲུྃ་ལས་འཁོར་ལོ་རྩིབས་བརྒྱད་དེ། །རྩིབས་བརྒྱད་རྣམ་ཤེས་བརྒྱད་ཀྱི་དངོས། །ཡོངས་སུ་གྱུར་པས་རྣམ་སྣང་སྐུ།
en: Bhruṁ creates an eight-spoked wheel. The eight spokes stand for the eight consciousnesses. The wheel transforms into the body of Vairocana.

source: །ཕྱི་ནས་བལྟས་པས་ནང་དུ་གསལ།
en: Viewed from the outside, he is luminous inside.

source: །དེ་བཞིན་ནང་ནས་ཕྱི་རུ་སྟེ།
en: Likewise, from inside out,

source: །ཐམས་ཅད་གཅིག་ཏུ་སྣང་བའི་དོན།
en: Meaning that all appears as one.

source: །ཚོན་ཆེན་སྣ་ལྔ་སྐུ་ལྔའི་དོན།
en: The five kinds of gems symbolize the five buddha bodies.

source: །ཁ་དོག་ལྔ་ནི་རིགས་ལྔའི་དོན།
en: The five colors indicate the five families.

source: ། ལོགས་བཞི་བསྡུ་བའི་དངོས་པོ་སྟེ།
en: The four sides are the four means of magnetizing.

source: །སྒོ་བཞི་དྲན་པ་ཉེར་གཞག་ཡིན།
en: The four gates are the four foundations of mindfulness.

source: །དེ་ནས་ནང་དུ་གཞལ་ཡས་ཁང་།
en: Then, inside, the celestial palace appears.

source: །ཀ་བ་བརྒྱད་ནི་རྣམ་ཐར་བརྒྱད།
en: The eight pillars are the eight liberations.

source: །གྲུ་བཞི་ཚངས་པའི་གནས་བཞིར་གསུངས།
en: The four corners are said to be the four pure abodes.

source: །གདུང་བཞི་ཡེ་ཤེས་བཞི་ཡི་དོན།
en: The four beams symbolize the four gnoses.

source: །ཏྭ་ར་ཎལ་སོགས་པ་ཀུན། །སྟོབས་ལ་སོགས་པ་ཡིན་པར་གསུངས།
en: All the gate adornments and so forth, Are said to be the powers and the like.

source: །དེ་ནས་ནང་དུ་གདན་རྣམས་ནི། །པདྨའི་ས་བོན་དབྱངས་ལས་སྐྱེས།
en: Then, as for the seats inside the palace, They are lotuses born from vowels as seed-syllables.

source: །འདོད་ཆགས་ལ་སོགས་ཉོན་མོངས་ཀྱིས། །མ་གོས་རྟགས་སུ་པདྨའི་གདན། །དེ་སྟེང་ཉི་མ་ཟླ་བ་སྟེ། །ཐབས་དང་ཤེས་རབ་གཉིས་ཀྱི་བརྡ།
en: The lotus seat indicates not being stained By the afflictions such as passion, etc. The sun and moon atop the lotuses Symbolize skillful means and wisdom.

source: །དང་པོ་རོ་ནི་ང་བདག་གམ། །རྣམ་རྟོག་འཇོམས་ཕྱིར་གསུངས་པ་ཡིན།
en: The corpse is taught first For the destruction of the self, or conceptuality.

source: །ཡན་ལག་བཞི་ལྡན་གཙོ་བོའི་གདན། །འཁོར་ལ་རེ་རེ་གདན་དུ་སྦྱིན། །གཙོ་བོའི་ཡན་ལག་ཡིན་པའི་ཕྱིར།
en: The four-featured seat of the central deity Is given as a seat to each member of the retinue, Since they each are an aspect of the central deity.

source: །དགོངས་པའི་དོན་དང་བཅས་པ་ཡིས། །རྟེན་གྱི་དཀྱིལ་འཁོར་རྫོགས་པའོ།
en: That completes the supportive maṇḍala Conjoined with its intended meaning.

source: །དེ་ནས་ལྷ་རྣམས་བསྐྱེད་པ་ནི། །སྐྱེ་བ་བཞི་ཡི་ཚུལ་ཡིན་ཏེ།
en: Next, the deities are generated According to the four types of birth.

source: །སྐད་ཅིག་ལས་བྱུང་རྫུས་པའི་ཚུལ། ། དཔེར་ན་ཆུ་གཏིང་ལས་ནི་ཉ།
en: The miraculous manner is to arise instantaneously, Like a fish jumping out of water.

source: །རྐྱེན་ལས་སྐྱེས་པ་དྲོད་གཤེར་སྐྱེས། །དཔེར་ན་ཉི་མས་པདྨ་བཞིན།
en: Birth from heat and moisture is to arise from conditions, Like a lotus nurtured by the sun.

source: །སྤྲོ་ཞིང་བསྡུ་བ་སྒོང་སྐྱེས་ཚུལ། །དཔེར་ན་རྡོ་ལས་ཟངས་བཞིན་ནོ
en: Birth from an egg happens through projection and absorption, Like copper produced from stone.

source: །སྦྱོར་བ་ལས་བྱུང་མངལ་སྐྱེས་ཚུལ། །ཡར་ལ་སྲེག་ཅིང་མར་ལ་གསོ། །དཔེར་ན་སྤྲ་ཚིལ་ལས་ནི་གཟུགས།
en: Birth from a womb occurs from union, Burned from above and formed from below, Like a statue created from wax.

source: །ཕོ་བྲང་རྣམ་པར་སྣང་མཛད་རྫོགས།
en: Vairocana is completed with the palace.

source: །རྗེས་སུ་སྐྱེད་པ་ཧེ་རུ་ཀ།
en: Later, the Heruka is generated.

source: །དབང་བསྐུར་བཅོམ་ལྡན་མི་བསྐྱོད་པ།
en: Conferring initiation is the Blessed One Akṣobhya.

source: །བསྟོད་པ་རིན་ཆེན་འབྱུང་ལྡན་ཡིན།
en: Praise is Ratnasambhava.

source: །མཆོད་པ་དོན་ཡོད་གྲུབ་པའོ།
en: Offering is Amoghasiddhi.

source: །བདུད་རྩི་མྱང་བ་འོད་དཔག་མེད།
en: Tasting ambrosia is Amitābha.

source: །ཡན་ལག་དྲུག་ལས་བྱུང་བ་ཡི། ། དངོས་གྲུབ་འདི་ནི་ཁྱད་པར་འཕགས།
en: The accomplishments that emerge From these six aspects are extraordinary.

source: །དེ་ནས་བཟླས་པའམ་བསྒོམ་པ་ནི།
en: Then, concerning the recitation, or meditation,

source: །དབང་པོ་རབ་འབྲིང་ཐ་མའི་སྟེ།
en: There are those of superior, mediocre and inferior faculties.

source: །རབ་ཀྱིས་ཡོངས་སུ་རྫོགས་པ་ཡི། །བསྒོམ་པའམ་བཟླས་པ་བྱ་བར་གསུངས།
en: It is said that superior ones Are to meditate, or recite in full.

source: །འབྲིང་གིས་གཙོ་བོ་ཡབ་ཡུམ་ཡིན།
en: The mediocre should focus on the central deity in father-mother union.

source: །ཐ་མས་དབུ་མའི་སྤྱན་ལ་འཇུག
en: The inferior are to apply themselves to the eyes of the central figure.

source: །དབུ་མའི་སྤྱན་ལ་བརྟན་གྱུར་ནས། །སུམ་ཅུ་རྩ་བདུན་རྫོགས་པར་སྒོམ།
en: Having reached stability on the eyes of the central figure, They are to meditate on the thirty-seven features in full.

source: །འབྲིང་པོ་ཡིས་ཀྱང་དེ་བཞིན
en: The mediocre are to do likewise.

source: ། འདི་ཡིས་བསྟན་པ་ཤིན་ཏུ་ཟབ།
en: Teaching this way is exceedingly profound.

source: ་དམན་པ་དབྱིབས། །ཟབ་པ་སྔགས་དང་ཐིག་ལེ་དང་། །མཐར་ཐུག་ཆོས་དང་ཡན་ལག་བདུན།
en: the inferior practice involves shape; The more profound involve mantra and seminal drops; And the ultimate involves dharma and the seven parts.

source: །གནས་པ་རྩ་དང་གཡོ་བ་རླུང་། །བཀོད་པ་སེམས་དང
en: Located in the body are channels; circulating within them are winds; Mounted on these is the mind—

source: །གོང་དུ་གསུངས་པ་ཐམས་ཅད་ཀྱང་། །རྣམ་པ་བཞི་རུ་ཤེས་པར་བྱ། །རེ་རེ་ལ་ཡང་བཞི་བཞི་སྟེ།
en: Everything taught above Should also be understood as four-fold. Each one, moreover, is four-fold;

source: །དུ་མའི་ཚུལ་ནི་ཤིན་ཏུ་ཟབ།
en: The manifold manner is exceedingly profound.

source: །ཕྱི་དང་ནང་ནི་སྔགས་ཀྱི་དོན།
en: Outer and inner is the meaning of mantra.

source: །ལས་སུ་རུང་བ་མཐར་ཕྱིན་དོན།
en: Proficiency is the meaning of perfection.

source: །གཟུགས་བརྙན་དཀྱིལ་འཁོར་ཕྱི་ཡི་དོན། །ཕྱི་ལ་ལྟོས་ནས་ནང་ཡིན་ཏེ། །དེ་ཉིད་གསང་བ་གསང་བའི་དོན།
en: The maṇḍala image is the outer meaning. Regarding the outer is the inner. The secrecy of just that is the secret meaning.

source: །ནང་དུ་དཀྱིལ་འཁོར་མཚན་ཉིད་ནི།
en: Inwardly, concerning the characteristics of the maṇḍala,

source: །ཕུང་པོ་སྐྱེ་མཆེད་ཁམས་རྣམས་
en: The aggregates, elements, and sense media

source: །བླ་མའི་ཞལ་ལས་ཤེས་པར་བྱ།
en: should be understood from a master’s oral instructions.

source: ། གཡས་གཡོན་སྟེང་འོག་སྒོ་ལ་སོགས།
en: Left, right, above, below, the gates, and so forth

source: །རེ་རེ་ལྷ་རུ་བྱིན་བརླབས་ལ། །ལྔ་འམ་དྲུག་གམ་སུམ་ཅུ་བདུན།
en: Are each transformed into a deity, either five, six, or thirty-seven;

source: །རྡོ་རྗེ་སྙིང་པོས་ཡང་གསོལ་པ།
en: Then Vajragarbha asked:

source: །སུམ་ཅུ་རྩ་བདུན་ཞེས་བྱ་བའི། །ཡོངས་སུ་རྫོགས་པ་ཇི་ལྟར་ལགས།
en: What is the completion Of the “thirty-seven”?

source: །བསྐྱེད་པ་ཞེས་བྱ་ཇི་ལྟར་ལགས།
en: How are they “developed”?

source: །དེ་ཡི་རིམ་པ་ཇི་ལྟར་ལགས།
en: What are their stages?

source: ་རྟེན་གྱི་དཀྱིལ་འཁོར་དང་། །ཐུན་དང་ཐུན་མཚམས་ཇི་ལྟར་ལགས།
en: What is the supportive maṇḍala like? And how are the sessions and breaks?

source: །ལྟ་སྤྱོད་ཟུང་དུ་ཇི་ལྟར་འཇུག
en: How are view and conduct united?

source: །དཔའ་བོས་བདག་ལ་བཤད་དུ་གསོལ།
en: Tell me, O Spiritual Hero!

source: །སུམ་ཅུ་རྩ་བདུན་ཡང་དག་རྒྱུ། །འབྲས་བུ་གཉིས་མེད་ཡེ་ཤེས་བསྐྱེད།
en: The thirty-seven, the pristine cause, Give rise to non-dual gnosis, the effect.

source: ། དེ་ཕྱིར་འབྲས་བུ་སྔོན་འགྲོ་བའི། །རྒྱུ་ནི་གཙོ་བོར་གྱུར་པ་ཡིན།
en: Therefore, the cause, which precedes the effect, Is to become the principal deity.

source: །ཧེ་རུ་ཀར་གྱུར་གཅིག་ལ་ཡང་། །རྒྱུ་རྣམས་ཡོངས་སུ་རྫོགས་པ་སྟེ།
en: Even in just becoming the Heruka All causes are complete;

source: །གནས་ནི་ཉི་ཤུ་རྩ་བཞི་སོགས། །བླ་མའི་ཞལ་ནས་ཤེས་པར་བྱ།
en: The twenty-four locations and so forth Should be learned from a master’s oral instructions.

source: །རྒྱུ་ནོར་བ་ལས་མ་ཡིན་ཏེ། །གྲོ་ལས་ནས་ཀྱི་མྱུ་གུ་མིན།
en: The effect does not come from a mistaken cause— Barley does not sprout from a grain of wheat.

source: ། མ་ཚང་བ་ལས་མ་ཡིན་ཏེ། །འབྲུ་ཉམས་པ་ལས་མྱུ་གུ་མེད།
en: Nor does it come from an incomplete cause— There is no sprout from damaged grain;

source: །རྒྱུ་མེད་པ་ལས་མ་ཡིན་ཏེ། །ནམ་མཁའི་མེ་ཏོག་ལས་ནི་དྲི།
en: Nor without a cause, Like fragrance from a space flower.

source: །རྒྱུ་དེ་རྐྱེན་མེད་པ་ལས་མིན། །ནགས་སྲེག་མེ་ལ་རླུང་མེད་བཞིན།
en: The cause is not a cause without conditions, Like a forest fire without wind.

source: །ལྷ་ཡི་རྣལ་འབྱོར་ལ་གནས་པས། །བསྐྱེད་པ་ཞེས་ནི་གསུངས་པ་ཡིན།
en: Development is said to be done By one who adheres to deity practice.

source: །ཕྱི་དང་ནང་དུ་དུ་མའི་ཆ། །དེ་ཡི་རིམ་པར་བཤད་པ་ཡིན།
en: Multiple aspects, external and internal, Are explained as its stages.

source: རྟེན་གྱི་དཀྱིལ་འཁོར་བྱེ་བྲག་ཀྱང་། །ཁྱམས་དང་བླ་གབ་མེད་པ་དང་། ། བླ་གབ་བཅས་དང་རྣམ་པ་གསུམ། །མོས་པའི་དབང་དུ་གསུངས་པ་ཡིན།
en: The particular supportive maṇḍala, Is said to be of three types— Without courtyard, without canopy, and with canopy— According to inclination.

source: །འཁོར་ལོ་བཞི་ཡི་དབྱེ་བ་ཡིས།
en: Due to the divisions of the four chakras,

source: །མཚམས་ཀྱང་བཞི་རུ་ཤེས་པར་བྱ།
en: Breaks should also be understood to be four.

source: །དབྱུག་གུ་ཆུ་ཚོད་འཕོ་བ་དང་། །ཐུན་བརྒྱད་བསྒོམ་པའི་རྣལ་འབྱོར་པས། །ཐུན་དང་མཚམས་ནི་མཉམ་པར་གསུངས།
en: It is taught that a practitioner who switches To twenty-two and a half minute hours and meditates in eight sessions Equalizes sessions and breaks.

source: །མཚམས་ཀྱི་ཚེ་ན་རྣལ་འབྱོར་པ། །དབང་པོ་འབྲིང་དང་ཐ་མ་ཡིས།
en: During breaks, practitioners Of mediocre and inferior faculties

source: །ལྷ་རྣམས་རྫོགས་པར་སྤྲོ་བྱས་ལ། །མར་མེ་གཅིག་ལས་གཉིས་ཀྱི་ཚུལ། ། མཆོད་པ་ལ་སོགས་ཚུལ་བཞིན་བྱ།
en: Should project the deities in full And properly perform offerings, and so forth, Like one candle igniting another.

source: །ལྟ་བ་ཞེས་པ་མཉམ་གཞག་སྟེ། །རྗེས་ཐོབ་སྤྱོད་པ་རུ་ནི་བཤད།
en: View refers to equipoise; Subsequent attainment is explained as conduct.

source: །བསྐྱེད་པའི་རིམ་པ་བསྒོམ་པ་ལས།
en: When practicing the development stage,

source: །རྒྱན་དྲུག་འཆང་བའི་སྤྱོད་པ་གནང་།
en: One is permitted to observe the conduct of wearing the six adornments.

source: །གསང་བའི་དབང་དང་འབྲེལ་བ་ལ།
en: In connection with the secret initiation,

source: །རྒྱན་དང་བདུད་རྩིའི་སྤྱོད་པ་གནང་།
en: One is allowed to observe the conduct of adornments and ambrosia.

source: ། རྡོ་རྗེའི་རིགས་དང་རིན་ཆེན་རིགས། །པདྨའི་རིགས་དང་ལས་ཀྱི་རིགས། །སྤྱོད་པ་གནང་བ་ང་ཡིས་གསུངས།
en: I have said that those of the vajra family, the ratna family, The padma family and the karma family are permitted to observe the conduct.

source: །ཤེས་རབ་ཡེ་ཤེས་དང་འབྲེལ་བས། །གོང་དུ་གསུངས་པ་ཐུན་མོང
en: Those connected with the wisdom-gnosis initiation Have in common what was taught above,

source: སྟེ། །ཁྱད་པར་ཕྱག་རྒྱའི་སྤྱོད་པ་གནང་།
en: and In particular, are permitted to observe the conduct of the seal.

source: །ལྟ་བ་མི་ལྡན་སྤྱོད་པ་དང་། ། སྤྱོད་པ་མི་ལྡན་ལྟ་བ་གཉིས།
en: With either conduct devoid of view, Or view devoid of conduct,

source: །འདི་ནི་གསང་སྔགས་དམ་སྲི་
en: One transgresses the pledges of secret mantra

source: །མནར་མེད་སེམས་ཅན་དམྱལ་བར་སྐྱེ།
en: takes birth as a hell-being in Endless Torment.

source: །དེ་ཕྱིར་ལྟ་མེད་སྤྱོད་པ་སྤང་།
en: Therefore, conduct devoid of view should be abandoned;

source: །སྲིན་པོ་ཁྲོས་པའི་སྤྱོད་པའོ།
en: It is the conduct of a hostile demon.

source: །སྤྱོད་མེད་ལྟ་བའང་སྤང་བ་སྟེ།
en: view devoid of conduct is also to be abandoned;

source: །དཀའ་ཐུབ་ཀྱིས་ནི་ལུས་གདུངས
en: Tormenting the body through austerities

source: །ཕུང་སོགས་རྣམ་སྣང་ལ་སོགས་ལ། །བརྙས་པ
en: despising the aggregates that are Vairocana and so forth

source: རྟོག་གེ་སྐམ་པོ
en: a dry intellectual.

source: །དེས་ན་ལྟ་སྤྱོད་ཟུང་དུ་འཇུག
en: Consequently, view and conduct are to be unified

source: །གླང་ཆེན་བཞེངས་ཀྱང་མཉམ་པར་བཞེངས། །གླང་ཆེན་བཞུགས་ཀྱང་མཉམ་པར་བཞུགས།
en: When an elephant rises it rises all together, And when an elephant sits it sits all together.

source: །རྡོ་རྗེ་སྙིང་པོས་ཡང་ཞུས་པ།
en: Vajragarbha then asked:

source: །བདུད་རྩི་ཞེས་པ་ཇི་ལྟར་ལགས། ། དེ་ཡི་སྤྱོད་པ་ཇི་ལྟར་ལགས། །དེ་ཡི་ཡོན་ཏན་ཇི་ལྟར་འབྱུང་།
en: What is meant by “ambrosia”? What conduct is associated with it? How do its qualities emerge?

source: །རྒྱན་ལ་སོགས་པའི་དོན་རྣམས་ཀུན། །གཙོ་བོས་བདག་ལ་བཤད་དུ་གསོལ།
en: Tell me, O Central Deity, All the meanings of the adornments and the rest!

source: །བདུད་རྩི་རྣམ་པ་གསུམ་དུ་གསུངས།
en: Ambrosia is taught as three-fold.

source: །ཡར་གྱི་ངོ་དང་མར་གྱི་ངོ་། །བརྒྱད་དང་བཅུ་བཞི་བཅྭ་ལྔ་ལ། །ཐམས་ཅད་བཟང་པོའི་དུས་སུ་གསུངས།
en: The eighth, fourteenth, and fifteenth days Of the waxing and waning lunar periods Are taught as auspicious times for everything.

source: །གླང་པོ་གླང་པོ་ཆེན་པོ་སྟེ། །ཀེ་ཏ་ཀ་ཡི་རྒྱུ་ཉིད་ལས། ། གླ་རྩི་ལ་སོགས་འབྱུང་བའི་ཤ།
en: As for ox, or elephant, This should be the flesh of one from which musk and the like emerges Based on the single material cause of it eating a ketaka flower.

source: །བ་ལང་གི་ཝང་ལྡན་པའི་ཤ།
en: Beef should be flesh that contains bile.

source: །རྟ་ནི་རྟ་ཡི་རྒྱལ་པོ་སྟེ། །ཁ་དོག་དཀར་མིན་དམར་བ་མིན། །དབྱིབས་དང་ཁ་དོག་མི་འགྱུར་ཤ།
en: Horse meat should come from the king among horses, Whose complexion is neither white nor red, With flesh that neither changes shape nor color.

source: །མི་ནི་སྐྱེ་བ་བདུན་པའི་ཤ།
en: Human meat must be the flesh of a seventh-birth.

source: །ལུས་ངག་ཡིད་ལ་མཁས་པས་བརྟགས།
en: An adept should investigate his body, speech, and mind.

source: །བཟའ་བའི་སྣོད་ནི་དུམ་བུ་གཅིག
en: The food container should be a skull-cup in a single piece.

source: །རབ་འབྲིང་ཐ་མའི་མཚན་མ་ནི།
en: Superior, mediocre, and inferior signs—

source: །འབར་དང་དུད་པ་སྤྲོ་བ་རྣམས།
en: Blazing, wafting, and bubbling

source: །མཚན་མ་ཕྱི་ཡི་ཡིན་པར་བཤད། །གཞན་སྐྱེས་དོན་ནི་རྒས་ཆེན་སེལ།
en: Are explained as pertaining to the external signs. Furthermore, the point of signs having arisen is that old age is eradicated.

source: །སྐད་མ་ཕྱིན་ན་དངོས་གྲུབ་མེད།
en: If sounds have not been heard there will be no accomplishment.

source: །སྐད་ཕྱུང་བས་ནི་ཚངས་པར་འགྱུར།
en: When sounds have issued forth one will become pure.

source: །ནང་གི་བདུད་རྩི་རང་བྱུང་ཡིན།
en: Inner ambrosia is self-arisen.

source: །དྲིལ་ཅན་བུ་ག་དགུ་ལམ་ནས། །འཛག་པའི་བདུད་རྩི་རྒྱུན་ཆད་ནས།
en: Having interrupted the flow of ambrosia dripping From the nine orifices of the one with the bell,

source: །ཏིལ་གྱི་འབྲུ་བཞིན་གང་བ་
en: It fills the body like sesame seeds.

source: །ཨ་བ་དྷཱུ་ཏཱིར་དབུགས་ཆུད་པས། །སྟེང་གི་དྲུག་པའི་རྒྱུ་བ་ཡིན།
en: as the breath enters the avadhūtī The circulation of the upper sixth is elicited.

source: །སི་ཧླ་ག་བུར་དབུས་ན་གནས། ། འོག་གི་དྲུག་པ་རྒྱུ་བ་ཡིན།
en: When silha and camphor abide in the center, The lower sixth circulates.

source: །འདི་ནི་གསང་བའི་བདུད་རྩི་སྟེ། །སྐྲ་དཀར་གཉེར་མ་འཆི་བ་སྤོང་།
en: This is the secret ambrosia, Which vanquishes grey hair, wrinkles, and death.

source: །སྤྱོད་པའི་རྣལ་འབྱོར་རྣམ་པ་གཉིས། །གང་ཟག་མཆོག་དང་ལས་དང་པོ།
en: The practice of conduct is two-fold: For superior and beginner persons.

source: །བསྐྱེད་པའི་རིམ་པར་ལེགས་གནས་ཤིང་། །རིགས་སུ་འཛིན་པ་སྤང་བའི་ཕྱིར། །ཕྱི་ཡི་དྲུག་པའི་བདུད་རྩི་སྦྱིན།
en: The ambrosia of the outer sixth is bestowed In order for them to adhere well to the development stage And abandon fixation to caste.

source: །ལས་དང་པོ་ལ་ཕྱི་ནང་གཉིས།
en: Beginners have both outer and inner

source: །འདི་ཡི་ནུས་པའང་དུ་མ་སྟེ།
en: Whose potencies are also manifold—

source: །སྐྲ་དཀར་མེད་ཅིང་རྣམ་རྟོག་འཇོམས།
en: It renders them devoid of grey hair and destroys conceptuality.

source: །དཀྱིལ་འཁོར་བཞི་ལ་རབ་ཏུ་གནས།
en: It consecrates the four maṇḍalas.

source: །ལྔ་པ་གོམས་པར་གྱུར་པ་ཡིས།
en: Through gaining familiarity with the fifth.

source: །དྲུག་པ་གཟུང་བར་གསུངས་པ
en: It is taught that one will seize the sixth

source: ཀུན་རྫོབ་སྟེང་གི་སྣ་རྩེ་ནས། །སོར་བཞི་ནས་ནི་དབུས་སུ་བཞུགས།
en: Which is situated at the center, Four finger-widths above the upper tip of the relative,

source: །སྟེང་གི་དྲུག་པ་ཟིན་པ་ཡིན།
en: The upper sixth is seized.

source: །ལྟེ་བའི་གནས་སུ་དབུགས་གནས་པ།
en: Settling the breath at the location of the navel,

source: །སྲེད་པ་མེད་ཅིང་ཡང་བའོ།
en: One will be devoid of craving and feel buoyant.

source: །འདབ་ཆགས་རྒྱལ་པོ་ཇི་བཞིན་དུ།
en: Just like an eagle,

source: ། ནམ་མཁར་འཕུར་ཞིང་ལྟུང་བ་མེད།
en: One will soar in the sky without plummeting.

source: །མཆོག་དང་ཆད་པའི་དབུས་གནས་པ། །འོག་གི་དྲུག་པ་ཡིན་པར་བཤད།
en: It is said that the lower sixth is situated At the center of the superior and disconnected ones.

source: །གང་ཟག་མཆོག་ལ་གསུངས་པ་ཡིན།
en: It is taught to superior persons

source: །དྲིལ་ཅན་བུ་ག་འགག་པར་བྱེད།
en: It blocks the orifice of the one with the bell.

source: །རྒྱན་གྱི་དང་པོ་ཞེ་སྡང་འཇོམས།
en: It destroys anger, the first of the adornments.

source: ། དུར་ཁྲོད་ཆེན་པོ་སིཧླ་ལིང་། །རུ་དྲ་འདུལ་བའི་རིམ་པ་སྟེ། །བདུད་རྩིས་རྣམ་རྟོག་ལ་སོགས་འཇོམས།
en: The stage of subjugating Rudra In the great charnel ground of Śītavana Is that conceptuality is destroyed with ambrosia.

source: །ཕྲིན་ལས་བཞི་ནི་ཐུན་མོང་ཡིན།
en: The four enlightened activities are in common.

source: །ཕྱག་རྒྱས་འདོད་ཆགས་རྣམ་པར་དག
en: Through the seal, desire is purified.

source: །དྲུག་པ་ཞེས་པ་ཇི་ལྟ་བུ།
en: What is meant by “the sixth”?

source: །གང་ཟག་མཆོག་ནི་ཇི་ལྟ་བུ།
en: What is a superior person like?
